## datascience related topics
* numpy
* pandas
* matploitlab

### pandas
- pandas is a package which is used to clean our data
- pandas make our work very simple and easy
- we can apply these pandaas for any type of data.(ordered ,unordered ,labled).
- data will be represented in the form of table
 #### main keywords in creating data:
* Series ---> Data will be displayed in the form of rows(line by line)
* Dataframe----> Data wil be displayed in the form of rows and columns.

In [3]:
import pandas as pd
import numpy as np

In [4]:
#### data creation using series:
f= pd.Series([1,2,3,4])

In [5]:
f

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
f1=pd.Series(["raja","mani","kumar"])
f1

0     raja
1     mani
2    kumar
dtype: object

In [8]:
#### data creation using numpy:
data =np.array(["raja","mani","kumar"])
data

array(['raja', 'mani', 'kumar'], dtype='<U5')

In [10]:
a=pd.Series(data)
a

0     raja
1     mani
2    kumar
dtype: object

In [25]:
a=pd.Series(data,index=[1,2,3])
a

1     raja
2     mani
3    kumar
dtype: object

In [26]:
## series creation from dictionary:
data ={'a':0,'b':1,'c':2}
data

{'a': 0, 'b': 1, 'c': 2}

In [27]:
data=[1,2,3,4,5,6]
d=pd.DataFrame(data)
d

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [34]:
#creating multiple columns using list format: 
data=[["raja",10],["mani",4],["kumar",6]]
d=pd.DataFrame(data,columns=("names","age"),index=np.arange(1,len(data)+1))
d

   names  age
1   raja   10
2   mani    4
3  kumar    6

In [36]:
#creating multiple columns using dictionary format:
data={"Name":['raja','mani','kumar','hari','anil','akhil','chanti'],"Age":[10,11,12,13,15,16,13]}
d=pd.DataFrame(data)
d

     Name  Age
0    raja   10
1    mani   11
2   kumar   12
3    hari   13
4    anil   15
5   akhil   16
6  chanti   13

In [39]:
data=[{'a':2,'b':4,'c':7},{'a':3,'b':6,'c':8}]
d=pd.DataFrame(data,index=["First","second"])
d

        a  b  c
First   2  4  7
second  3  6  8

In [41]:
data ={'a':0,'b':1,'c':2}
d=pd.Series(data)
d

a    0
b    1
c    2
dtype: int64

In [42]:
d.dtype

dtype('int64')

In [43]:
d.values

array([0, 1, 2], dtype=int64)

In [44]:
d.index

Index(['a', 'b', 'c'], dtype='object')

In [48]:
a=[1,2,3,4,5]
d=pd.Series(a,index=np.arange(1,6))
d

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [49]:
### accessing of elements from series and dataframe:
data={"Name":['raja','mani','kumar','hari','anil','akhil','chanti'],"Age":[10,11,12,13,15,16,13]}
d=pd.DataFrame(data)
d

     Name  Age
0    raja   10
1    mani   11
2   kumar   12
3    hari   13
4    anil   15
5   akhil   16
6  chanti   13

In [51]:
d["Name"]

0      raja
1      mani
2     kumar
3      hari
4      anil
5     akhil
6    chanti
Name: Name, dtype: object

In [52]:
d["Age"]

0    10
1    11
2    12
3    13
4    15
5    16
6    13
Name: Age, dtype: int64

In [55]:
d[:2]

   Name  Age
0  raja   10
1  mani   11

In [58]:
d2=d.reindex(['a','b','c','d','e'])
d2

  Name  Age
a  NaN  NaN
b  NaN  NaN
c  NaN  NaN
d  NaN  NaN
e  NaN  NaN

In [72]:
d

ohio      35000
texas     71000
oregon     1600
utah       5000
dtype: int64

In [61]:
sdata = {'ohio':35000,'texas':71000,'oregon':1600,'utah':5000}
d=pd.Series(sdata)
d

ohio      35000
texas     71000
oregon     1600
utah       5000
dtype: int64

In [62]:
d.head() #for getting first 5 values

ohio      35000
texas     71000
oregon     1600
utah       5000
dtype: int64

In [63]:
d.head(2)

ohio     35000
texas    71000
dtype: int64

In [64]:
d.tail() #for getting last 5 values

ohio      35000
texas     71000
oregon     1600
utah       5000
dtype: int64

In [66]:
d.tail(3)

texas     71000
oregon     1600
utah       5000
dtype: int64

In [67]:
d2.tail()

  Name  Age
a  NaN  NaN
b  NaN  NaN
c  NaN  NaN
d  NaN  NaN
e  NaN  NaN

In [68]:
d2.isnull()

   Name   Age
a  True  True
b  True  True
c  True  True
d  True  True
e  True  True

In [69]:
d.isnull()

ohio      False
texas     False
oregon    False
utah      False
dtype: bool

In [70]:
d.describe()

count        4.000000
mean     28150.000000
std      32269.025396
min       1600.000000
25%       4150.000000
50%      20000.000000
75%      44000.000000
max      71000.000000
dtype: float64

In [73]:
data={"Name":['raja','mani','kumar','hari','anil','akhil','chanti'],"Age":[10,11,12,13,15,16,13]}
d=pd.DataFrame(data)
d

     Name  Age
0    raja   10
1    mani   11
2   kumar   12
3    hari   13
4    anil   15
5   akhil   16
6  chanti   13

In [74]:
d.describe()

             Age
count   7.000000
mean   12.857143
std     2.115701
min    10.000000
25%    11.500000
50%    13.000000
75%    14.000000
max    16.000000

In [75]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
Name    7 non-null object
Age     7 non-null int64
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

In [83]:
## iloc and loc
d.iloc()

In [79]:
d.loc()

In [84]:
## iloc --> for integer indices use iloc
## loc --> for character indices use loc

In [85]:
a=pd.read_pdf("file.pdf")

AttributeError: module 'pandas' has no attribute 'read_pdf'